---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.BorderLeftLineStyle
source: html/cd24dd5f-2c1d-4cf6-cdb2-7c0d75781b02.htm
---
# Autodesk.Revit.DB.TableCellStyle.BorderLeftLineStyle Property

The element id (GraphicsStyle element) for the left line of the cell border.

## Syntax (C#)
```csharp
public ElementId BorderLeftLineStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null